cmsis-svd/cmsis-svd/data/Microchip/ATSAMV70NxB.svd
            <register>
               <name>XDMAC_GWS</name>
               <description>Global Channel Write Suspend Register</description>
               <addressOffset>0x2C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>WS0</name>
                     <description>XDMAC Channel 0 Write Suspend Bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WS1</name>
                     <description>XDMAC Channel 1 Write Suspend Bit</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WS2</name>
                     <description>XDMAC Channel 2 Write Suspend Bit</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WS3</name>
                     <description>XDMAC Channel 3 Write Suspend Bit</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WS4</name>
                     <description>XDMAC Channel 4 Write Suspend Bit</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WS5</name>
                     <description>XDMAC Channel 5 Write Suspend Bit</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WS6</name>
                     <description>XDMAC Channel 6 Write Suspend Bit</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WS7</name>
                     <description>XDMAC Channel 7 Write Suspend Bit</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WS8</name>
                     <description>XDMAC Channel 8 Write Suspend Bit</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WS9</name>
                     <description>XDMAC Channel 9 Write Suspend Bit</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WS10</name>
                     <description>XDMAC Channel 10 Write Suspend Bit</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WS11</name>
                     <description>XDMAC Channel 11 Write Suspend Bit</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WS12</name>
                     <description>XDMAC Channel 12 Write Suspend Bit</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WS13</name>
                     <description>XDMAC Channel 13 Write Suspend Bit</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WS14</name>
                     <description>XDMAC Channel 14 Write Suspend Bit</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WS15</name>
                     <description>XDMAC Channel 15 Write Suspend Bit</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WS16</name>
                     <description>XDMAC Channel 16 Write Suspend Bit</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WS17</name>
                     <description>XDMAC Channel 17 Write Suspend Bit</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WS18</name>
                     <description>XDMAC Channel 18 Write Suspend Bit</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WS19</name>
                     <description>XDMAC Channel 19 Write Suspend Bit</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WS20</name>
                     <description>XDMAC Channel 20 Write Suspend Bit</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WS21</name>
                     <description>XDMAC Channel 21 Write Suspend Bit</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WS22</name>
                     <description>XDMAC Channel 22 Write Suspend Bit</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WS23</name>
                     <description>XDMAC Channel 23 Write Suspend Bit</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>XDMAC_GRWS</name>
               <description>Global Channel Read Write Suspend Register</description>
               <addressOffset>0x30</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>RWS0</name>
                     <description>XDMAC Channel 0 Read Write Suspend Bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWS1</name>
                     <description>XDMAC Channel 1 Read Write Suspend Bit</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWS2</name>
                     <description>XDMAC Channel 2 Read Write Suspend Bit</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWS3</name>
                     <description>XDMAC Channel 3 Read Write Suspend Bit</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWS4</name>
                     <description>XDMAC Channel 4 Read Write Suspend Bit</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWS5</name>
                     <description>XDMAC Channel 5 Read Write Suspend Bit</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWS6</name>
                     <description>XDMAC Channel 6 Read Write Suspend Bit</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWS7</name>
                     <description>XDMAC Channel 7 Read Write Suspend Bit</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWS8</name>
                     <description>XDMAC Channel 8 Read Write Suspend Bit</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWS9</name>
                     <description>XDMAC Channel 9 Read Write Suspend Bit</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWS10</name>
                     <description>XDMAC Channel 10 Read Write Suspend Bit</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWS11</name>
                     <description>XDMAC Channel 11 Read Write Suspend Bit</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWS12</name>
                     <description>XDMAC Channel 12 Read Write Suspend Bit</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWS13</name>
                     <description>XDMAC Channel 13 Read Write Suspend Bit</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWS14</name>
                     <description>XDMAC Channel 14 Read Write Suspend Bit</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWS15</name>
                     <description>XDMAC Channel 15 Read Write Suspend Bit</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWS16</name>
                     <description>XDMAC Channel 16 Read Write Suspend Bit</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWS17</name>
                     <description>XDMAC Channel 17 Read Write Suspend Bit</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWS18</name>
                     <description>XDMAC Channel 18 Read Write Suspend Bit</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWS19</name>
                     <description>XDMAC Channel 19 Read Write Suspend Bit</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWS20</name>
                     <description>XDMAC Channel 20 Read Write Suspend Bit</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWS21</name>
                     <description>XDMAC Channel 21 Read Write Suspend Bit</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWS22</name>
                     <description>XDMAC Channel 22 Read Write Suspend Bit</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWS23</name>
                     <description>XDMAC Channel 23 Read Write Suspend Bit</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>XDMAC_GRWR</name>
               <description>Global Channel Read Write Resume Register</description>
               <addressOffset>0x34</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>RWR0</name>
                     <description>XDMAC Channel 0 Read Write Resume Bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWR1</name>
                     <description>XDMAC Channel 1 Read Write Resume Bit</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWR2</name>
                     <description>XDMAC Channel 2 Read Write Resume Bit</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWR3</name>
                     <description>XDMAC Channel 3 Read Write Resume Bit</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWR4</name>
                     <description>XDMAC Channel 4 Read Write Resume Bit</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWR5</name>
                     <description>XDMAC Channel 5 Read Write Resume Bit</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWR6</name>
                     <description>XDMAC Channel 6 Read Write Resume Bit</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWR7</name>
                     <description>XDMAC Channel 7 Read Write Resume Bit</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWR8</name>
                     <description>XDMAC Channel 8 Read Write Resume Bit</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWR9</name>
                     <description>XDMAC Channel 9 Read Write Resume Bit</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWR10</name>
                     <description>XDMAC Channel 10 Read Write Resume Bit</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWR11</name>
                     <description>XDMAC Channel 11 Read Write Resume Bit</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWR12</name>
                     <description>XDMAC Channel 12 Read Write Resume Bit</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWR13</name>
                     <description>XDMAC Channel 13 Read Write Resume Bit</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWR14</name>
                     <description>XDMAC Channel 14 Read Write Resume Bit</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWR15</name>
                     <description>XDMAC Channel 15 Read Write Resume Bit</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWR16</name>
                     <description>XDMAC Channel 16 Read Write Resume Bit</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWR17</name>
                     <description>XDMAC Channel 17 Read Write Resume Bit</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWR18</name>
                     <description>XDMAC Channel 18 Read Write Resume Bit</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWR19</name>
                     <description>XDMAC Channel 19 Read Write Resume Bit</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWR20</name>
                     <description>XDMAC Channel 20 Read Write Resume Bit</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWR21</name>
                     <description>XDMAC Channel 21 Read Write Resume Bit</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWR22</name>
                     <description>XDMAC Channel 22 Read Write Resume Bit</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWR23</name>
                     <description>XDMAC Channel 23 Read Write Resume Bit</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
